-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 09 2020 г., 15:18
-- Версия сервера: 10.3.13-MariaDB-log
-- Версия PHP: 7.1.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `coursework1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `books`
--

CREATE TABLE `books` (
  `id` int(11) NOT NULL,
  `author` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` decimal(15,2) NOT NULL,
  `genre` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `year` int(11) NOT NULL,
  `age` int(11) NOT NULL,
  `pages` int(11) NOT NULL,
  `language` varchar(255) NOT NULL,
  `imageId` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `books`
--

INSERT INTO `books` (`id`, `author`, `name`, `price`, `genre`, `description`, `year`, `age`, `pages`, `language`, `imageId`) VALUES
(37, 'Оскар Уальд', 'Портрет Дориана Грея. Сборник', '130.00', 'Роман; Фантастика; Классика', 'Знаменитый роман не подвластен времени и по праву считается шедевром английской литературы. Драматичная, парадоксальная, завораживающая история Дориана Грея, ставшего жертвой желания вечной молодости. Талантливый художник создал портрет, который забирал на себя все грехи Дориана и следы его прожитых лет. Эту страшную тайну Грей будет хранить любой ценой... \r\n\r\nТакже в книгу вошли произведения «Принц и ласточка», «День рождения Инфанты», «Дитя-звезда», «Соловей и роза» и др.', 2016, 16, 640, 'Русский', '5b208fb83fe64.jpeg'),
(38, 'Е.М.Ремарк', 'Тріумфальна арка', '110.00', 'Классика; Роман', 'Франція, 1939 рік. Світ на порозі Другої світової війни. Людвіг — один з тих, хто вже відчув жорстокість нацистів: він пройшов тортури гестапівців, концтабір, утратив кохану. Рятуючись, чоловік тікає до Франції та змінює ім’я. Відтепер він хірург-біженець Равік. Митарства та злидні емігрантської долі лягають на плечі чоловіка. Одного разу він зустрічає Джоан Маду, актрису з Італії. Вона так само, як і Равік, самотня й загублена в цьому холодному світі. Лиха година поєднує їхні душі, а кохання, яке спалахує між ними, стає гірким від сліз… ', 2018, 16, 480, 'Українська', '5b20907b5891f.jpeg'),
(39, 'Джон Апдайк', 'Іствікські відьми', '122.00', 'Сучасні автори; Фантастика', 'Життя в містечку Іствік розплановане на сто, а то й двісті років уперед. У цій тихій гавані вже давно не відбувалося нічого цікавого. Троє подруг — Александра, Джейн і Зукі — збираються щочетверга, щоб якось розважитися. Після чергових посиденьок у місті з’являється таємничий і надзвичайно спокусливий чоловік із дивним ім’ям Дерріл Ван Горн. Він здобуває прихильність подруг і… навчає магії, адже виявляє їхні потужні здібності. Та одного разу вони вирішують покинути Дерріла. Він присягається помститися їм… Проте жоден чоловік не в змозі протистояти жінці. А надто коли їх троє. І вони — відьми.', 2018, 16, 384, 'Українська', '5b2091413d848.jpeg'),
(40, 'Н. Гейман', 'Никогде', '166.00', 'Фантастика; Фэнтези', 'Под Лондоном скрывается место, о котором большинство людей даже не подозревают. Город монстров, святых, убийц и ангелов, рыцарей в сияющих доспехах и бледных девушек в черном бархате. Город тех, кто провалился сквозь трещины жизни. В этой стране свои законы, вам без надобности деньги, но зато могут пригодиться знакомства с крысами и навыки боевых искусств, а если не погибнете в первые два дня, то перед вами откроется удивительный мир Никогде, как он открылся перед молодым Ричардом...', 2018, 0, 416, 'Русский', '5b20922781817.jpeg'),
(41, 'А. Сапковський', 'Відьмак. Останнє бажання. Книга 1', '106.00', 'Фантастика; Фэнтези', 'Від Яруги до Драконячих гір мандрує один з останніх відьмаків – Ґеральт із Рівії. Він зустрічає людей та істот, які чимось дуже нагадують персонажів відомих казок, і намагається зрозуміти, чи залишилося в ньому самому хоч щось від людини. А може, він – тільки додаток до двох своїх мечів: звичайного залізного та відьмачого, з карбованим руків’ям та срібним клинком, який колись стане для нього мечем призначення…', 2016, 0, 288, 'Українська', '5b2092b9a0c82.jpeg'),
(42, 'А. Крісті', 'Випробування невинуватістю', '83.00', 'Детектив', 'У маєтку Сонячний Ріг знаходять мертвою місіс Рейчел Арґайл. У вбивстві звинувачують її прийомного сина Джека. Його ув’язнюють, адже в чоловіка немає алібі. Через певний час доктор Артур Калґарі заявляє, що може надати це алібі. Але в’язень помер ще до початку судового розслідування. Калґарі сповнений рішучості за всяку ціну виправдати Джека, нехай навіть посмертно, однак родина Арґайл не бажає допомагати йому в розслідуванні. Несподівано відбувається ще одне вбивство.\r\n\r\nЯкі таємниці приховує Сонячний Ріг і його мешканці? Чи причетні вони до того, що сталося? Хто цей вовк в овечій шкурі?\r\n', 2018, 0, 288, 'Українська', '5b20947878533.jpeg'),
(43, 'Ден Браун', 'Інферно', '124.00', 'Сучасні автори; Фантастика', 'Цей роман було названо найкращим твором Дена Брауна! Автор, як завжди, приготував для нас роман з божевільним сюжетом, де світ класичних витворів мистецтва замінює реальний, а читач поринає у небезпечні перегони з часом. \r\n\r\n9 кіл. 7 гріхів. 1 таємниця. Професор Ленґдон приходить до тями у лікарні, не пам’ятаючи нічого, навіть як тут опинився. У кишені він знаходить першу підказку, проте це лише початок. Адже невідомий ворог випереджає його на крок.', 2016, 0, 608, 'Українська', '5b2094e81c49a.jpeg'),
(44, 'Рэй Брэдбери', '451° за Фаренгейтом', '150.00', 'Фантастика; Фэнтези', 'Повний контроль суспільства урядом... Читання книг — кримінальний злочин, який безпощадно карається державою... Пожежники, покликані розпалювати вогонь... 451 за Фаренгейтом — температура, за якої горить папір — температура суспільного настрою та сердець мешканців антиінтелектуального світу. Саме таким постає життя людей майбутнього на сторінках роману Рея Бредбері.\r\nДумати, до речі, заборонено також... І, схоже, уряд країни досяг би своєї мети, змусивши націю відмовитися від усіх знань і почуттів, якби не пожежник, внутрішня свобода якого сягнула вище термометра за Фаренгейтом...', 2015, 0, 208, 'Українська', '5b2095b76f5dd.jpeg'),
(45, 'Симона Вилар', 'Фея с островов. Книга 1', '90.00', 'Історико-пригодницькі; Роман', 'Шотландия, XVI век. Маленькая Мойра со своей матерью Гертой прибыли на отдаленный остров, никто из местных жителей ничего не знает про их прежнюю жизнь. Вскоре на остров прибывает застигнутый штормом пожилой вождь могущественного клана Маккензи Гектор Рой. Он очарован пятнадцатилетней Мойрой и решает забрать ее с собой, чтобы сделать… наложницей. Мать убеждает девочку, что это — подарок судьбы, шанс вырваться из бедности и почувствовать совершенно другую жизнь… \r\n\r\nДля того, чтобы поссорить два соседних клана, граф Перси и предложил своему поверенному Дэвиду Майсгрейву похитить Мойру, чтобы вызвать волнения между кланами Маккензи и Манро… План срабатывает. Впереди — побег и длинный путь, полный опасностей. Мойра хотела бы вернуться к Рою, но, среди всех ужасных событий, которые ей придется пережить, она находит новую любовь. Сильную, взаимную, но запретную…', 2017, 0, 336, 'Русский', '5b2096945b079.jpeg'),
(46, 'Джеймс Роллинс', 'Кости волхвов', '280.00', 'Історико-пригодницькі; Фантастика', 'В Кельнском соборе во время праздничной службы происходит массовое убийство: все прихожане погибают мучительной смертью. Преступники, облаченные в монашеские рясы, похищают бесценную реликвию, хранившуюся в соборе с XII века, — кости библейских волхвов. Из Вашингтона для расследования преступления послана группа спецагентов секретной организации \"Сигма\" во главе с Греем Пирсом. Совместно с учеными Ватикана группе удается установить, что в убийстве и похищении замешан Имперский орден дракона — тайное братство алхимиков, корни которого уходят в глубь веков.', 2018, 0, 640, 'Русский', '5b20971438551.jpeg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `books`
--
ALTER TABLE `books`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
